---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.YZJustificationOption.Independent
enum: Autodesk.Revit.DB.Structure.YZJustificationOption
source: html/f569aef8-8c20-1a52-cccc-31e17d2e623d.htm
---
# Autodesk.Revit.DB.Structure.YZJustificationOption.Independent

Independent justification settings applied to the element ends.